Revit 2027 API
BuiltInFailures.InterferenceFailures Class
 Failures about Interference.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.InterferenceFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class InterferenceFailures
Public NotInheritable Class InterferenceFailures
public ref class InterferenceFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type InterferenceFailures = class end
The BuiltInFailures.InterferenceFailures type exposes the following members.
Properties
Name | Description
GeometryWarning |  A geometrical error has occurred while checking for Interference. Reported interference may not be accurate.
Top
See Also
Reference
Autodesk.Revit.DB Namespace